{
  "intents": [
    {"tag": "greeting",
     "patterns": ["Hi there", "How are you", "Is anyone there?","Hey","Hola", "Hello", "Good day", "Hey", "Ekse", "Hi"],
     "responses": ["Hi there! Thanks for dropping by, if this is your first time here, just go ahead and ask me what I can do or how i can help. If not, then Shoot!"]
    },
    {"tag": "goodbye",
     "patterns": ["goodbye", "talk later", "Goodbye", "Ok bye", "Bye Bye"],
     "responses": ["Goodbye my friend. Keep working on yourself, and we'll have better days ahead!"]
    },
    {"tag": "thanks",
     "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
     "responses": ["Happy to help!", "Any time!", "My pleasure", "You are welcome", "Sure dude"]
    },
    {"tag": "noanswer",
     "patterns": [],
     "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand", "I am still here dude"]
     },
     {"tag": "name",
      "patterns": ["What is your name", "Whats your name", "Tell me your name", "Who are you", "Ungubani", "Tell me about yourself", "You are"],
      "responses": ["I am aMIGO", "My name is aMIGO", "You can call me aMIGO ", "I am aMIGO, nice to meet you", "aMIGO is my name"]
      },
      {"tag": "options",
       "patterns": ["What do you do", "How can you help", "What do you know", "What is your purpose"],
       "responses": ["I can give you generic therapy centered advice in the most commonly addressed cases in therapy and counselling, namely:\n1) Depression\n2)Anxiety\n3)Stress\n4)Anger management\n5)eating disorders\n6)Self worth... An example question to initiate a conversation with me is \"I have trouble sleeping\" or \"I feel depressed\""]
      },
     {"tag": "Depression_info",
      "patterns": ["Depression", "What can you tell me about depression", "depression", "What about depression", "What do you know about depression", "Tell me more about depression", "What can you tell me about depression", "Tell me about depression", "Pakaoma, i feel depressed", "ko Depression howfar", "Tell me more about Depression"],
      "responses": ["Anxiety and depression are often linked. I don't consider them as diseases. Depression is a symptom of deep hurts to the sense of self that leaves a person feeling shamed. I understand you aMIGO, you're doing great, It is not something you should keep bottled up. How is your sleep schedulue, do you struggle to sleep or find yourself sleepless",
                    "Depression and anxiety can arise due to experiences, genetics or a combination of both. I like for my friends to look at their issues as whole persons so I would also recommend these tips:Physical: regular exercise, healthy balanced diet, rest and sleep Mental: how we think is how we feel. do you usually stay up late at night?",
                    "people have the ability to reflect on situations in their lives. Even if nothing currently goes on in a particular moment, it’s possible you’re reflecting on a serious or upsetting matter. And, our emotions linger within us. is there anything at work, school or your relationship that is stressing you out?"]
      },
      {"tag": "Sleepless",
       "patterns": ["I have been having trouble sleeping", "I am sleepless", "ndiri kutadza kurara", "I have been failing to sleep", "restless", "I am restless", "I am sleep deprived", "I stay up late", "restless at night", "stay up late at night"],
       "responses": [
         "As often as possible, sleep during daytimes in order for your body to catch up on its need for rest. do you sleep at the same time every night? (respond:yes I sleep at the same time or No i do not sleep at the same time each night",
         "Do you usually use your devices just before bed? (respond: yes i use my phone before bed or no i do not use my phone before bed.",
         "Sometimes just the act of being able to talk about things with a nonjudgmental person helps take some of the burden off of you. A therapist can help you change your thought patterns and teach you coping skills to reduce your symptoms. If you ever need me to recommend a qualified therapist for you, do not hesitate to say please recommend a therapist for me. Do you feel any level of depression? or are you worried about school, work or any form of relationshi[p"
       ]
      },
      {"tag": "anxiety",
        "patterns": ["im worried about hit400","i anxious about my presentation","When I'm in large crowds I get angry and I just can't deal with people", "I have more conversions in my head than I do with actual people", " don't know what's wrong with me and why I feel so anxious. What should I do", "anxiety", "I'm, feeling anxious", "I have anxiety", "anxious", "worried"],
        "responses": ["I think you have a lot of insight into what’s going on - being able to pinpoint the issue you’re facing and describe the responses it evokes. It sounds like you may be dealing with social anxiety and it may be beneficial to talk to a professional counselor about this. If you need me to recommend a therapist, just say please recommend a therapist for me. If you have any other issues like depression, or failing to sleep or low self esteem, please do say", "Reaching out to talk about these issues is an important first step. Finding professional services might be recommended if these issues are happening more and more. A few things to note...Anger is an important secondary feeling to be aware of- it keeps us safe, allows us to stand up for ourselves or others....but it also harbors a myriad of disadvantages. Do you find yourself feeling angry or sad at any point", "Anxiety has a lot to do with worrying about the future, especially things that we might not be able to control. If we focus our worry on negative things- mistakes, failures, or messups then we will inherently tell ourselves negative things about ourselves. It could also lead to low self esteem. Do you ever feel like you're not good enough?", "It's totally normal to feel overwhelmed and uncomfortable in large crowds, or large family gatherings. You may worry about not fitting in, or having anything to say. It is important to have a friend or two. Try to find someone with similar interests. Maybe you can do things that don't involve a lot of face to face contact, like going to see a movie, play or sporting event. If you have ongoing conversations in your head, it is usually due to worry about being judged, and wanting to do or say the exact right thing. Finding someone to talk to, either a supportive friend or therapist, would allow you to get some of those thoughts our of your head, and realize that you are more accepted than you think. You should try these things, and hopefully you see yourself improving. Any other problem you're facing?", "If its because of bad or stressful encounters, betrayals or some type of violation, then having this relationship pattern remain in your mind, may introduce new problems such as loneliness from lack of close friends.What you should do is honestly understand whether you avoid people from fear of being hurt or exploited in some way or because you genuinely prefer solitude.If you have the right combination of people/solitude, then great!If not, then consider the confidential office of a therapist for new understanding of yourself and your social interests. Tell me if you need resources of a therapist or counsellor and i'll give a few recommendations", "I'd recommend starting by writing down your self-talk.  It sounds like you are telling yourself a lot of negative messages (like having imaginary conversations and assuming people are judging you).  Write down the thoughts that are leading to you feeling terrible and crying.  Maybe that's:  I'm stupid, Everyone else is having a good time so I should be too, There's something wrong with me.  Just writing these down is an important starting point because it allows you to be objective to your thoughts.  When you see them on paper, you can start to identify the lies and reframe them. Try this, and hopefully after a bit you'll see some positive results. Any other problem you'd like a bit of advice on?"
        ]
      },
      {"tag": "self-esteem",
        "patterns": ["I'm always told I'm not good enough or trying hard enough","I feel hopeless. I feel like i'm not good enough", "I feel like i'm not good enough", "I feel like i'm not worth anything", "I feel like I hate myself physically and emotionally sometimes", "i have low self esteem", "I don't feel confident", "I feel low", "I feel like I'm not good enough", "I feel empty"],
        "responses": ["The feeling of never feeling good enough usually stems from our early relationship with our parents or significant role models who made us to feel we were never good enough to meet their standards. In the healing process, you'll need to work on discovering the root source of where these thoughts and feelings come from and then learn to accept yourself just as you are unconditionally. Do you keep a diary?", "It sounds like you are aware of your positive traits but you are struggling with someone who does not acknowledge nor celebrate your efforts or achievements.   It seems like that is affecting your inner voice, which allows you to accept yourself for who you are.My suggestion is to explore that relationship and decide if that person’s opinion should determine how you feel about yourself.   If this is an important relationship, you could communicate to this person how the lack of positive feedback is affecting you. Would you be comfortable talking to a therapist or counselor?", "explore with a Counselor your inner voice and try to figure out if the negative message is settling in and harming your self-esteem. Through therapy, you could learn to self-compassion and acceptance wich will help your self esteem. Do you want me to recommend some resources for you?", "The easiest person for us to blame is ourselves. We can start feeling so low as to want to check out with things like food, and TV. It can take time for us to move to self-forgiveness, and self-kindness in order to start moving forward. I wonder what you can do right now to improve your situation? I also wonder if you may be willing to seek counseling to help you work through some of this, to help with your perspective. Just reading these sentences, I get the sense of you being a nice person. I hope you can show that kind of kindness to yourself in your healing. Do you ever feel any anxiety around other people?", "Self-acceptance is hard! And it's on a spectrum. On one side we have self-hate, on the other extreme; self-love. And then, there is all this stuff in the middle. It kind of looks like this and working toward self-love often means moving around through all these. Becoming aware of your emotions, exploring the parts of you you that easier and harder to accept, self-kindness, self-forgiveness, self-compassion and ultimately self-love. It is a recovery process and has to be an active thing each day. You should try keeping a diary and record all the things you love about yourself, or have done and you're very proud of. Do you ever feel any anxiety or depression?", "Self-doubt and self-hatred are such common and unpleasant experiences and really worth  understanding! Therapy with the right person can really help. When in your life do you feel the most confident? What gets in the way of you accepting and loving yourself (big question!) Try sit down and think about that one. Do you need to talk to a professional about it?", "I can assure you that you are not alone. We are bombarded by media and advertisements everyday that try to sell us things to make us somehow better, thus leading us to believe that we are not enough. Unfortunately, I believe that low self esteem is a social epidemic.On a more personal level, do you have any sense of what types of messages you have received in your life that have led to these self defeating thoughts? For example, did a parent or another loved one criticize you or put you down often? Were you bulled in school? Has a romantic partner emotionally abused you? Usually, there are factors such as these which insidiously lead to low self esteem and self loathing. Once you can identify some of the factors that lead to your self hatred, you can make a decision to not let these things from your past have such power over you any more. You learn to take control of how you feel about yourself, rather than letting others dictate that for you. have you ever seen a therapist with these issues?"
          
        ]
       },
       {"tag": "relationship-dissolution",
        "patterns": ["i dont love him","i dont love her anymore","How do I decide if I should end my relationship with my partner", "Should i break up with my partner"],
        "responses": ["Hi!I’m sorry you’re having this dilemma. I wish I knew a little more about the situation to give a better answer. Have you discussed what is causing you to consider breaking up with your partner? Based on the information given, I suggest starting off making a pros and cons list. Pros for staying in the relationship and cons for staying. See which side has more. Follow your gut. Hope this helps as a start.", "This can be a very difficult question to answer. Without knowing anything else about the situation - it makes me wonder - what makes you feel like you should break up with them? What brought up thinking about ending things? It will be important to decide if the relationship is safe, if it is healthy, and if it makes you both happy. Are there reasons you are staying in the relationship that don't make you feel good? It might be helpful to write things out or talk to a trusted friend about what each of your choices means. What would it be like to end things? What would it be like to stay? Are there issues that the two of you can work on to make the relationship better?"

        ]
        },
        {"tag": "relationship-fix",
          "patterns": ["My partner and I are separated and they don't even want to talk to me.", "I want my partner back", "How do i get my partner back"],
          "responses": ["I believe there's always hope. I also believe that you are worthy of respect and love. I'm curious if you felt loved, cherished, and respected by your partner during your time together. Feeling willing to go to any extreme to save the relationship is common, but having to do things that go against your values sets you up to develop a lot of resentment. It sounds like you did not want to be separated from your partner, but now that it's happened, you can make the choice to focus on yourself, rediscovering, or discovering for the first time, what you really want out of life.", "I would focus on YOU right now. We cannot control them, their actions, their love, or their decisions. But we can work on you. Think about a few things: What do you want? What do you love about them? What made you two separate? What do you think about being in a relationship where your partner does not love you? Does that seem fair? they may want to work things out or they may be done. they may be done for a short period of time or be done forever. No one can answer that which is why I think you should change the focus."
          ]
         }, 
        {"tag": "workplace-relationship",
            "patterns": ["i hate my boss","i dont like my boss","My boss took over some work I'd begun. Concerned that she had doubts about my work, i asked her for feedback."],
            "responses": ["This interaction with your boss seems strange. It is tricky to know how to handle workplace conflicts, but there are typically resources in place to help employees and managers communicate successful and feel confident that they are being treated fairly at work. Is there an HR department that you can use as a mediator?"
            ]
        },
        {"tag": "work-stress",
        "patterns": ["I am in a high stress position for a tech company. I am being overworked and underpaid for my contributions and it is not only giving me anxiety, but also demoralizing. What can I do to manage my stress?", "I am working too hard", "I am being underpaid", "The work is too much"],
        "responses": ["I think it's important to tease more of this situation out to figure out what is at the root of the stress. It is emotionally dangerous to be at a job for a lengthy duration in which you feel overworked and underpaid. You will not perform well as you mention, and thus your self-esteem will continually take a hit without really any effort. So, I don't know that simply coping with your stress would be advisable as a first step.You don't speak about a lot of what the office dynamics are like, which can be a big indicator for me of what can be done to help you feel better (because we exist as a part of a relationship with everything, including people at our job.) I would encourage you to speak up about your contributions to your boss.", "Being in this position is tough. If seeking another career opportunity isn't viable, there are a couple of things you can do to manage stress on the job.  1. Have a ritual to begin the day:  Consider setting a one sentence intention and plan tasks for the day2. Take the breaks you are offered. I know it can be difficult to step away from your desk to eat lunch or take 10-minute breaks during the day, but prioritize this if you can. Sometimes 30 minutes of downtime and fresh air can help you feel better.", "Do you have the option of talking to your employer about your experiences and feelings with regard to your current work? Do you have local resources that you can use to find different jobs in your field? Do you have connections with employment counselors or agencies that can support you with strategies in dealing with workplace stress? These questions might cause others to bubble up, and could begin a new journey into a new field.While still at your job, what can you do to take care of yourself? Are you taking breaks? Do you eat lunch at the office, or do you go somewhere away from the office to eat? What do you do when you have a few moments to breathe? Understanding that you can indeed find even the smallest strategies useful for self-care, can help bolster your energy and give you some support as you move through the day. Seeking the support of family and friends can be helpful as well. Knowing your personal limits and when to pull back and take a break will give you a chance to recharge your mental and physical energy, thus helping you face the demands of your job."
        ]
    },
    {"tag": "spirituality",
      "patterns": ["i don't know what to say, I have never really known who I am"],
      "responses": ["What exactly is it that you are looking for? Different people define themselves in different ways. For example, one person may define himself by his values and morals while another identifies herself by her personality and characteristics. Still, another person may define himself by his interests and hobbies. Learning who you are as a person can take time and life experience. At the same time, who you are may change according to what experiences you have had and how you have dealt with them or felt about them. Try viewing the journey of finding yourself as exciting and ongoing. Allow yourself to feel emotions and learn how they relate to the experiences you have. This may help you to know more about what you value, what you like and dislike, and what you want for yourself in life. Best of luck to you!", "The older I get, the more I believe that our real task isn't to 'find' ourselves. We're already 100% \"there.\" What we do have to do is become more mindful of the times when we feel the most alive, most happy, most creative, and most fully engaged with life. It is in those moments that we find ourselves.For example, I couldn't help loving the people or things I loved, no matter who tried to talk me out of them. All I needed to do was notice when my heart opened and I felt the most alive--not because I was afraid or addicted, but because in those moments, I was in contact with my highest self. On the flip side, I needed to recognize the people and activities that consistently brought out the worst in me--the ones that made me feel controlled, constricted, dishonest, resentful, or afraid--and be honest about them. Mindfulness of \"what already is\" is the key to finding yourself.", "Therapy may be an effective way for you to get a stronger sense of who you are. A competent therapist will work to create a safe and curious therapeutic relationship in which you can explore your identity. There are also many different exercises which you can do in and out of therapy which you may find helpful in this area as well.", "This quiet wonder that you have is something you can easily explore. There is a part of you that you can access anytime, anywhere. It is the part that has always been with you. Find a quiet place where you can be alone for a while and get comfortable. Settle in. Let your thoughts go by like a river. Stay with that connection for a while. What you find in the silence is yours alone, your \"you\"."
      ]
  }, 
  {"tag": "trauma",
    "patterns": ["There are issues from my past that have me very heavily burdened in my heart.", "I experienced trauma", "I feel traumatised", "i have trauma"],
    "responses": ["You are reaching out (virtually still counts!). You are accepting your past, you are not denying what happened to you, you are talking about the past. You are already doing a great job of starting this journey. You get your life back by doing things differently.I would think about how you would like to process your past. Do you want to talk to someone? Do you want to write about it? Do you want to pray about it? Do you want to read and research books about trauma? Take some time and think about what you want to do. Think about what would work for you and dive in. I am biased - but I really believe that counseling works. Having an objective, professional voice that can guide you on this process is so valuable.", "I'm so sorry you had that horrible experience! It's common for those who've experienced childhood trauma(s) to not disclose the events until later in life. Sometimes it doesn't feel safe enough to share the information until the person who hurt them is far away, or even dead.  Trusting and vulnerability are difficult, especially when we've been hurt. I am confident that the help of a licensed professional counselor (preferably trained in trauma recovery) can help you navigate this healing journey and help you gain the tools needed for the life you want."
    ]
}, 
{"tag": "anger-management",
  "patterns": ["I snap easy and push people away.", "I have anger issues", "I feel angry", "i am angry"],
  "responses": ["Anger is not usually just anger. Behind our anger may lie rejection, grief, loneliness, a longing to reconnect, etc. When we ignore or repress our anger, we are always ignoring these other emotions as well. Meditation is the midpoint between expressing and repressing anger. It allows us a space to stay present with it as it arises and recognize the many faces of anger. By doing this, we are able to become aware of our feelings to learn more about them and not be swept away by them. Learn more here: https://www.therapybyshannon.com/blog-2/2019/4/26/meditate-to-manage-anger", "Awareness is the first step.  Now that you know that you snap and push people away, you can look into ways to control your anger.  If you give yourself the time to analyze why you experience anger, you will discover that there are other feelings underneath;  shame, frustration, disappointment, and fear are some of the feelings that we cover with anger when we are not ready to deal with them or don’t know how to express them.  So next time you feel angry, even if you snap (with practice you will be able to identify them ahead of time), identify why you are angry, and try to express it out loud.  A therapist can help you to learn assertive communication skill using examples drawn from your daily experiences.If you would like to engage in therapy, just ask me to refer you to some resources i know of", "Anger is a normal emotion, no different than joy, elation, or sadness. It's not anger that gets us in trouble it's the overtness of the emotion or how we allow it to manifest that gets us in trouble. Being able to control your temper depends on several variables: how you saw anger acted out as a child in terms of your primary caregivers and what you internalized as being normal in terms of managing conflict, and your communication style regarding how you confront problematic situations. There are some whose anger takes on a volcano effect whereby they don't readily address problematic situations but rather they continue to stuff their emotion until the right trigger causes them them to explode, and then there are those who are very impulsive in terms of how they react to stressful situations, they don't take time to think out situations or to make sense of them, they just impulsively respond. I would encourage you to seek anger management from a therapist who utilizes a Cognitive Behavioral approach in order that you may explore how your irrational thinking related to certain situations may be influencing your problematic behavior. In addition, I would encourage you to engage in activities that promote stress reduction if your blowups are indeed related to being overly stressed. The first step is recognizing that you have a problem that you need help in understanding and addressing, which you have, now take the next step in finding a therapist in order that you may learn to control your temper and undo some faulty wiring that may be related to how you process emotion, and communicate that you're angry. Remember, anger is the overt expression of some other emotion (i.e., disappointment, hurt, frustration, etc..) If you ever need therapist resource information, just give a shout, or I can recommend other ressources if you're not ready for therapy"
  ]
}, 
{"tag": "sleep-improvement",
  "patterns": ["I have been having nightmares", "It takes me a long time to fall asleep. I often have nightmares"],
  "responses": ["Are you facing any type of overwhelming situation in your waking life?Dreams and nightmares are the non-logical ways in which we make emotional sense of what goes on in our everyday waking world.Besides having some type of relaxing bedtime routine to set a peaceful mood for your sleep, and avoiding viewing violent films and video games as entertainment, maybe even avoiding news stories which sometimes have similar themes of violence, the content of our dreams and nightmares is out of our direct control.Your nightmares may offer useful clues as to what you're trying to resolve in your life.  Pay attention to the story of your nightmare because it reflects how you feel in waking life.If you feel helpless and silenced in your nightmare, or taken advantage of, or whatever dreadful situation goes on during your nightmare, then look for where in waking life, you may feel similar.In this way, you'll become clearer about stressors in your life that you may not have realized existed were it not for the stress of nightmares. For a bit more insight, you can visit: https://www.webmd.com/sleep-disorders/nightmares-in-adults", "ou’re noticing that as you lie down to go to sleep, there is quite a bit going on, which may be anxiety related. It sounds like the dreams and difficulty sleeping are reminiscent of previous experiences you had. These connections to past events may be important insights to continue exploring in addition to finding out more about what your dreams may be trying to tell you. There is no exact science to dreams, but many people find it fruitful to explore the content as it relates to significant themes in their lives. I think that exploring these issues further with a therapist could help you resolve whatever is causing you the stress, trouble sleeping, and frightening dreams. Would you like to find a therapist to discuss these things with?"
  ]
},
{"tag": "substance-abuse",
  "patterns": ["I tend to overdrink", "I drink a lot", "i have a drinking problem", "too much alcohol"],
  "responses": ["I commend you for your courage in taking a look at the role alcohol has in your life. I suspect you already know the answer to your question about whether you have a problem or not. You might have a \"problem\" but that does not necessarily mean that you are an addict. I don't have information to know if \"addiction\" or \"dependence\" or other words would best describe where you are with drinking, but it sounds like it's begun to have some negatives, so forgive me using words like addict, dependence and so on. I mean it more as a road map than a diagnosis. The feedback I'm writing here is very general and doesn't address physical dependence and many other factors that might apply to your situation.  One of the ways to think about substance (mis)use is to think of addiction as a disease of avoidance. Let me repeat that: it is a disease of avoidance. Your ultimate task in living a balanced life is to figure out what you're avoiding and develop other ways to manage those feelings, experiences, and so on. And of course, along the way, you may want to look at triggers, situations, biological vulnerability, social pressures, coping skills, relapse prevention planning and so on. Depending on where you are in your drinking, you might very well benefit from expertise and support. Remember also that alcohol depresses our central nervous system and disinhibits us. That means that alcohol is often a substance of choice to relax, destress, calm down, etc. Also, it allows feelings, thoughts, and behaviors that we usually inhibit to be expressed. I suggest you seek professional help if you find yourself failing to stop. You can visit: \"https://www.health.harvard.edu/diseases-and-conditions/11-ways-to-curb-your-drinking\" to get some helpful tips, or I can recommend professional resources?", "if you feel 'really guilty after a night of drinking', then you probably have a problem. What you could do is visit this website by the National Institutes of Health: http://rethinkingdrinking.niaaa.nih.gov/How-much-is-too-much/  There you will find information on how many drinks is too much, and the general answer for women is more than seven drinks in a week. There is also a quiz you can take anonymously that will help you determine if your drinking is a problem. The good news is that you can get help for substance abuse through counseling, self-help programs, or alcoholics anonymous. Want me to refer you?"
  ]
},
{"tag": "eating-disorder",
  "patterns": ["I have a problem with binge eating, especially during times of stress", "I binge eat"],
  "responses": [" There are many coping mechanisms for binge eating and one of the best is actually attempting to NORMALIZE eating. Meaning you need to attempt to eat normally, eating appropriately portioned meals 3 times a day, with snacks in between. IF you binge, then it may be helpful to remind yourself that when you attempt to compensate for your bingeing behaviors, and you end up feeling restricted from over exercising or undereating, then this actually leads to a binge again. Thus, reverting you back to the cycle. If you binge, it will be helpful to try and get back on a normal schedule of eating instead of trying to compensate for the binge. Although it may feel counterproductive, getting back on a normal eating schedule will prevent you from entering into the restrictive cycle. It can also be helpful to remind yourself that the binge has already occurred, it is in the past and the goal is to move forward without focusing on the past. Focus on what you can do differently next time. What emotions or situations led up to the binge? What can you to do prevent or change the circumstances that led to the binge, or the way that you handled the situation? Lastly, if you're struggling with \"normalizing\" eating, it can be helpful to work with a professional that can provide counseling and coaching to help you learn how to eating normally, mindfully and without feeling the guilt and other harmful emotions sometimes associated with disordered eating. You can visit \"https://www.healthline.com/nutrition/how-to-overcome-binge-eating#TOC_TITLE_HDR_4\" for more tips, or i can link you to some resouces you can use"
  ]
},
{"tag": "stress",
  "patterns": ["I need help dealing with stress", "How can i handle stress", "stressing"],
  "responses": ["Part of handling stress is making sure that your perception of the stress is accurate. Sometimes stress can seem more than it really is. One thing that I encourage my clients to do is to ask themselves, \"What is this stressor really about?\" Simplifying stress is a key to minimizing stress and leads to feeling less stressed out. you can visit:\"https://www.cdc.gov/violenceprevention/about/copingwith-stresstips.html\" for help with some issues. Or i can refer you to a therapist. Does this stress lead to anger, anxiety or any form of depression?", "There are many causes for feeling stressed out. Between a demanding job, family responsibilities, and everything else that can come up, stress becomes more and more part of our everyday life. One of the best ways to combat the toxic effects of stress on our bodies, social lives, and overall well being is to engage in self-care. But not the self-care that most people think of like vacations or massages. The best self-care is the kind that helps you live the life that you already have rather than escape it. You see, the reason why vacations and massages don't work long term in reducing stress is that they allow you to escape from what is causing the stress without truly fixing it so you just return to what already stressed you out. So, instead you need to find ways to help live with the stressors that you already have. They can be things like creating a more manageable schedule, introducing healthy eating or exercising, financial planning, and even learning a few simple relaxation skills. The key to combatting stress is to make small but consistent changes to your life so that it becomes more manageable and more enjoyable. Do you have trouble sleeping, anxiety, or any other problems due to this stress? Do you keep a diary of your triggers?", "Our body reacts to stress typically by breathing more shallowly, increasing our heart rate and tensing our muscles - so one thing that I find really effective is to try to do the opposite of that, which sends the signal to our mind that we are relaxed. So that means, taking slower, fuller breaths and trying to relax any areas where we might be gripping our muscles. Check out meditation apps such as 'Breathe', which can talk you through a relaxing breath exercise. I recommend using the app daily, whether you feel stressed or not, and then also using it when you re feeling particular moments of stress - that way you are practicing the skill when you feel calm(wish) and it'll be ready and able to help you when stress hits hard. I recommend a Mindful Based Stress Reduction MBSR program, you can look that up, see if you like it. If you'd like some therapist or counsellor resources instead?"
  ]
 },
 {"tag": "self-harm",
  "patterns": ["I self-harm", "I intentionally hurt myself"],
  "responses": ["In a way, self-harm can present somewhat like an addiction.  According to new research within the field of neuroscience there is a valid explanation for this.  When a person cuts or uses other forms of self harm, the body produces endorphins to help make a person feel better.  If a person was dealing with depression or high anxiety, that might be misinterpreted by the brain as a way to help oneself feel better and a new neural network or map might form (addiction) that would utilize this new behavior.  Another way to look at it would be thru a behavioral lens, a positive reward for a behavior, even though the behavior has other long term negative consequences. I strongly suggest you see a therapist or if you can afford one, you can contact The Friendship bench. They are a great free resource you can make use of. You can find them here: https://www.friendshipbenchzimbabwe.org/contact-us", "Self-harm has a way of becoming a go-to method of coping. When we get stuck using self-harm as a way to deal and manage emotions, when something serious happens it totally makes sense that that will be one the first things to go through the mind. It is its own kind of addiction. If you ever find your situation getting worse i suggest you call this Toll Free number: 080 12 333 333"
  ]
},
{"tag": "afford-therapy",
  "patterns": ["I can't pay for therapy", "I cannot afford therapy", "therapy is expensive"],
  "responses": ["You're in luck, there are some free resources out there that you can use. You can visit: https://shri-res.netlify.app to see a collection of resources available that you can use as alternatives"
  ]
},
{"tag": "short-answer",
  "patterns": ["no", "I do not", "yes"],
  "responses": ["As much as concise answers are good, please add some more context to your response so we can better understand each other. For example you can say, \"No i do not feel old\""
  ]
},

{"tag": "more-info-depression",
  "patterns": ["more information about depression", "I need to know about depression", "what is depression","more on depression","just need to know about depression"],
  "responses": ["Sure depression is  a mood disorder that causes a persistent feeling of sadness and loss of interest. Also called major depressive disorder or clinical depression, it affects how you feel, think and behave and can lead to a variety of emotional and physical problems. You may have trouble doing normal day-to-day activities, and sometimes you may feel as if life isn't worth living.","Here is a link where you can read more on this: https://www.mayoclinic.org/diseases-conditions/depression/ ","You can visit: https://psychiatry.org/patients-families/depression for more information"
  ]
},

{"tag": "more-info-anxiety",
  "patterns": ["more information about anxiety", "I need to know about anxiety", "what is anxiety","more on anxiety","just need to know about anxiety"],
  "responses": ["Sure, Anxiety is a feeling of fear, dread, and uneasiness. It might cause you to sweat, feel restless and tense, and have a rapid heartbeat. It can be a normal reaction to stress. For example, you might feel anxious when faced with a difficult problem at work, before taking a test, or before making an important decision " , "Here you can read more on this: https://www.mayoclinic.org/diseases-conditions/anxiety","You can visit: https://www.healthline.com/health/anxiety for more information"
  ]
},

{"tag": "vague-feeling",
  "patterns": ["I am feeling sad", "I am sad"],
  "responses": ["I am sorry you are feeling this way. Please provide more context so i can give better tailored advice. Is this sadness accompanied by a feeling of depression, anxiety or anger?"
  ]
},
{"tag": "phone-use",
  "patterns": ["I use my phone just before bed", "I do not use my phone before bed"],
  "responses": ["The National Sleep Foundation recommends that you should stop using electronic devices, like your cellphone, at least 30 minutes before bedtime. Instead, grab the book that’s been tucked away in your nightstand and start reading before bed. You’ll be impressed with how much more quickly you fall asleep and how much better you’ll feel the next day. Do you also sleep at the same hour each night?"
  ]
},
{"tag": "bed-time",
  "patterns": ["I sleep at the same time", "I do not sleep at the same time"],
  "responses": ["maintaining a regular sleep schedule, according to several small studies, may cut down on the amount of time you spend tossing and turning before drifting off. inconsistent routine prevents your body from releasing hormones at the right time to make you feel sleepy and awake, thereby throwing off your circadian rhythm (body clock). You should incorporate this, and not using your devices before bed to have some good, healthy habits"
  ]
}, 
{"tag": "diary",
  "patterns": ["I keep a diary", "I do not keep a diary"],
  "responses": ["Keeping a diary helps control your symptoms and improve your mood by: 1) Helping you prioritize problems, fears, and concerns 2) Tracking any symptoms day-to-day so that you can recognize triggers and learn ways to better control them 3) Providing an opportunity for positive self-talk and identifying negative thoughts and behaviors. Keep in mind that journaling is just one aspect of a healthy lifestyle for better managing stress, anxiety, and mental health conditions."
  ]
},
{"tag": "follow-up",
  "patterns": ["I never feel like i'm not good enough"],
  "responses": ["That's alright, that's good to hear actually. Do you have other problems from this though? like sadness, depression or stress, lack of sleep. Anxiety can lead to a myriad of issues. If you ever feel them, don't be afraid to give a shout. Would you like me to share some resources with you?"
  ]
},
{"tag": "talk-professional",
  "patterns": ["I need to talk to a professional", "please recommend me to a professional", "give me some resources", "i need a therapist", "recommend resources", "Give me resources", "refer me to a therapist", "please recommend a therapist for me", "I would be confortable talking to a therapist"],
  "responses": ["Happy you're making this choice. You'll be pleased to know these resources are all centered around Zimbabwe. For a list of free resources and communities you can visit: https://shri-res.netlify.app \n For Therapist recommendations from the community, you can visit: https://www.whodoyou.com/l/harare--zimbabwe/counseling-therapist. For a toll-free suicide prevention line, you can contact: 080 12 333 333, I'm sure you'll be happy to know it's a 24hour service"
  ]
},
{"tag": "no-need",
  "patterns": ["I do not need a therapist", "i don't want therapist recommendations", "I don't want recommendations", "I'm not comfortable talking to a therapist"],
  "responses": ["It's alright, that is something you can do when you're ready. For now you can try thinking on what we discuss and hopefully it bears fruit and we feel better. Any other problem you'd like to tell your aMIGO about?"
  ]
},
{"tag": "hate-school-stuff",
    "patterns": ["School is stressing me out", "I'm worried about school", "I'm worried about exams", "Too much pressure at school", "school pressure" , "I hate school" , "I dont like school"],
    "responses": ["Practice Mindfulness Exercises, there are many ways to go about learning about and practicing mindfulness, going to a yoga class or listening to audio mindfulness meditations.", "Try Spending Time in Nature, ecotherapy has been shown to reduce symptoms of depression. Lets try it out!"
  ]
  }, 
  {"tag": "love-school-stuff",
    "patterns": ["School is great", "I love school","I like school", "I'm excited about exams", "excited about school", "school is amazing"],
    "responses": ["Thats great, keep doing the things that you love!", "Education is our passport to the future, for tomorrow belongs to the people who prepare for it today", "The road to freedom ,here and everywhere on earth, begins in the classroom", "You have brains in your head. You have feet in your shoes. You can steer yourself any direction you choose."
  ]
  }, 

  {"tag": "miscellaneous",
    "patterns": ["0783957858", "1234567890", "Paul Pogba", "Germany", "cw4tr2fq4", "asdfg"],
    "responses": ["I'm sorry, I'm having trouble understanding what you just said. Please rephrase your statement, or try to be more coherent"
    ]
  },

  {"tag": "hate",
    "patterns": ["I hate", "I dont like", "I dislike", "hatred", "I despise"],
    "responses": ["Hatred normally stems from anger, are you angry about something" , "Avoid all-or-nothing thinking: If your hatred toward others is rooted in a disagreement with them about a specific issue, try to remember that you can disagree–and even be angry–with others without hating them. Just because you strongly disagree with someone else’s beliefs or behavior does not mean that person is all bad. This type of thinking is called all or nothing thinking, and it is irrational. Remind yourself that your feelings of hate are about the issue, not the person.", "Avoid generalizing: If your hatred toward others focuses on a group of people, such as people of a certain race, region, or religion, your thinking is irrational because you are generalizing. You are lumping an entire group of people into one “bad” category and making assumptions about them based on a demographic characteristic", "Practice empathy: Nuance and empathy are antidotes to irrational thoughts. It’s important to understand that no one is all good or all bad. Putting yourself in someone else’s shoes, while not always easy, can go a long way toward increasing empathy and reducing hate. Just as you have your reasons for your beliefs and behaviors, so do others.","Prioritize self-care: It’s important to prioritize your needs and take care of yourself. For instance, if you are stressed out, you may need to make changes to your life to better cope. Or, if you are an introvert, you may need to set boundaries that help make you more comfortable"
    ]
  },

  {"tag": "severe",
    "patterns": ["severe depression", "suicidal", "suicide", "severe anxiety", "I cant take it anymore!", "panic attack","i need help","SOS","0000"],
    "responses":["https://wa.me/c/263784845294","+263784845294","+263784845294","08012333333","+2634995"
  ]
  },


  {"tag": "not-necessary",
    "patterns": ["I love", "I like", "I love hunting", "I like", "I love"],
    "responses": ["Good for you, keep it up. Is there any problem I can help you with?" , "Good to hear, how is your mental health?", "Way to go. Can I help you with anything affecting your mental health?"
    ]
  },
  {"tag": "Privacy",
    "patterns": ["I have questions about my privacy", "what about my information", "tell me about my data"],
    "responses": ["Dont worry buddy, whatever you say here is between just us", "i can keep a secret","your data is encrypted and shredded, noone can access it"
    ]
  }


    ]
}